import math


def area(r):
    """ 
    вычисляет площадь круга 
        параметры:
            r (float) : радиус круга 
        возвращаемое значение:
            float : площадь круга
        примеры:
           >>> area(5)
           78.53981633974483
           >>> area(2.5)
           19.634954084936208
    
    """
    return math.pi * r * r


def perimeter(r):
    """
    вычисляет периметр круга
        параметры:
            r (float) : радиус круга 
        возвращаемое значение:
            float : периметр круга
        примеры:
            >>> perimeter(5)
            31.41592653589793
            >>> perimeter(2.5)
            15.707963267948966
    """
    return 2 * math.pi * r

