def area(a, b):
    """
    вычисляет площадь прямоугольника
        параметры:
            a (float) : длина первой стороны
            b (float) : длина второй стороны
        возвращаемое значение:
            float : площадь прямоугольника
        примеры:
            >>> area(5, 10)
            50
            >>> area(2.5 * 5)
            12.5
    """
    return a * b

def perimeter(a, b) :
    """
    вычисляет периметр прямоугольника
        параметры:
            a (float) : длина первой стороны
            b (float) : длина второй стороны
        возвращаемое значение:
            float : периметр прямоугольника
        примеры:
            >>> perimeter(5, 10)
            30.0
            >>> perimeter(2.5, 7)
            19.0
    """
    return (a + b) * 2