
def area(a):
    """
    вчисляет площадь квадрата
        параметры:
            a (float) : длина стороны квадарата
        возвращаемое значение: 
            float : площадь квадрата
        примеры: 
            >>> area(5)
            25
            >>> area(3.5)
            12.25
    """
    return a * a


def perimeter(a):
    """
    вычисляет периметр квадрата
        параметры:
            a (float) : длина стороны квадарата
        возвращаемое значение: 
            float : площадь квадрата
        примеры: 
            >>> perimeter(5)
            20
            >>> perimeter(3.5)
            14.0
    """
    return 4 * a
