def area(a, h) :
    """
    вычисляет площадь треугольника
        параметры:
            a (float) : длина стороны
            h (float) : высота, опущенная на сторону a
        возвращаемое значение:
            float : площадь прямоугольника 
        примеры:
            >>> arae(5, 6)
            15.0
            >>> area(5, 3.5)
            8.75
    """
    return 1/2 * h * a

def perimeter(a, b, c):
    """
    вычисляет периметр треугольника 
        параметры:
            a (float) : длина первой стороны трегольника
            b (float) : длина второй стороны треугольника
            c (float) : длина третьей стороны треугольника
        возвращаемое значение:
            float : периметр треугольника
        примеры:
            >>> perimeter(5, 6, 4)
            15.0
            >>> perimeter(7, 2.5, 7.5)
            17.0
    """
    return (a + b + c)